In [2]:
import pandas as pd

data = pd.read_csv("../../datasets/drinks.csv")

data.head(5)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

## usefull properties and methods

In [3]:
data.index

RangeIndex(start=0, stop=193, step=1)

In [4]:
data.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [5]:
data.shape

(193, 6)

### get info and stats on the DataFrame

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
country                         193 non-null object
beer_servings                   193 non-null int64
spirit_servings                 193 non-null int64
wine_servings                   193 non-null int64
total_litres_of_pure_alcohol    193 non-null float64
continent                       170 non-null object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.1+ KB

In [7]:
data.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

### get column(s)

In [8]:
# dot syntax is ok (though slower), if we need only 1 column
data.continent.head(3)
# %time data.continent

0    AS
1    EU
2    AF
Name: continent, dtype: object

In [9]:
# square brackets syntax is more flexible (check below)
data["continent"].head(3)
# %time data["continent"]

0    AS
1    EU
2    AF
Name: continent, dtype: object

In [10]:
data[["continent", "country"]].head(3)

  continent      country
0        AS  Afghanistan
1        EU      Albania
2        AF      Algeria

### get rows

In [11]:
# by specifying integer location:
data.iloc[0]

country                         Afghanistan
beer_servings                             0
spirit_servings                           0
wine_servings                             0
total_litres_of_pure_alcohol              0
continent                                AS
Name: 0, dtype: object

In [12]:
data.iloc[0:5]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### get values

In [13]:
data.wine_servings.max()

370

In [14]:
data[data.wine_servings == data.wine_servings.max()]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
61,France,127,151,370,11.8,EU

## set_index()

In [15]:
new_data = data.set_index("country")

In [16]:
data.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF

In [17]:
new_data.head(3)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,AS
Albania,89,132,54,4.9,EU
Algeria,25,0,14,0.7,AF

In [18]:
# remove the row index name
new_data.index.name = ""

### reset index (and return column back)

In [19]:
# we use loc[] to select by name location
new_data.loc['Albania']

beer_servings                    89
spirit_servings                 132
wine_servings                    54
total_litres_of_pure_alcohol    4.9
continent                        EU
Name: Albania, dtype: object

In [20]:
# the row above was returned as Series object, but
# the slice is returned as DataFrame object
new_data.loc["Algeria":"Bahamas"]

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
,,,,,
Algeria,25,0,14,0.7,AF
Andorra,245,138,312,12.4,EU
Angola,217,57,45,5.9,AF
Antigua & Barbuda,102,128,45,4.9,NaN
Argentina,193,25,221,8.3,SA
Armenia,21,179,11,3.8,EU
Australia,261,72,212,10.4,OC
Austria,279,75,191,9.7,EU
Azerbaijan,21,46,5,1.3,EU
Bahamas,122,176,51,6.3,NaN

### reset the index (and return the column back)

In [21]:
new_data.index.name = "Country"

In [22]:
new_data.reset_index(inplace=True)
new_data.head(3)

,Country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF

## Clean the values

In [25]:
dirty = pd.DataFrame({"col1": [1, 2, None, 4], "col2":[None, 4, 6, 9]})
dirty.head(3)

   col1  col2
0   1.0   NaN
1   2.0   4.0
2   NaN   6.0

### Fill all NaN vlaues with 0

In [27]:
clean = dirty.fillna(value=0).astype("int32")
clean.head(3)

   col1  col2
0     1     0
1     2     4
2     0     6